---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.Schema.Lookup(System.Guid)
source: html/a83707a4-8924-cf77-9d8b-71ce10127f24.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Schema.Lookup Method

Finds the Schema corresponding to the GUID in memory.

## Syntax (C#)
```csharp
public static Schema Lookup(
	Guid guid
)
```

## Parameters
- **guid** (`System.Guid`)